Revit 2027 API
BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInMainModel Property
 A sweep in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConfusingSweepByElementsInMainModel { get; }
Public Shared ReadOnly Property ConfusingSweepByElementsInMainModel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInMainModel {
	FailureDefinitionId^ get ();
}
static member ConfusingSweepByElementsInMainModel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace